driver-tests/aspectse/Throttling/ThrottlingCompositeApp/test/ThrottlingInOutCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://com.sun.jbi/etl/etlengine">
<SOAP-ENV:Body>
  <outputItem xmlns="http://com.sun.jbi/etl/etlengine">
    <status>Failure</status>
    <startTime>2007-02-26T09:51:04.03Z</startTime>
    <endTime>2007-02-26T09:51:04.04Z</endTime>
    <rowsInserted>0</rowsInserted>
  </outputItem>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
