driver-tests/aspectse/Throttling/ThrottlingCompositeApp/test/ThrottlingInOutCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:etl="http://com.sun.jbi/etl/etlengine">
  <soapenv:Body>
    <etl:inputItem>
      <etl:arg_0>TESTING IN OUT MESSAGE INTO THROTTLE</etl:arg_0>
    </etl:inputItem>
  </soapenv:Body>
</soapenv:Envelope>