driver-tests/aspectse/filterRequestReply/CompositeApp/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <outputItem xmlns="http://com.sun.jbi/etl/etlengine">
      <status>Failure</status>
      <startTime>2007-02-20T08:24:36.56Z</startTime>
      <endTime>2007-02-20T08:24:39.35Z</endTime>
      <rowsInserted>0</rowsInserted>
    </outputItem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
